Lecture-Notes/Sep.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Sep</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Sep"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-21T13:38+0400"/>
<meta name="author" content="Abraham Xiao"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Sep</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 September, 2014</a>
<ul>
<li><a href="#sec-1-1">1.1 20140831</a></li>
<li><a href="#sec-1-2">1.2 20140903</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Nash bargaining solution</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 20140907</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 President's choice                                        :Decision tree:</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 20140917</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 CR4, 13:30</a></li>
<li><a href="#sec-1-4-2">1.4.2 Courses, Tutorials and Programming</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 20140921</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 Battle of the Sexes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> September, 2014</h2>
<div class="outline-text-2" id="text-1">




</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 20140831</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>We model the world by "Games".
</li>
<li>Game theory and repeated interactions.
</li>
<li>Decision making.
</li>
<li>Social choices and mechanisms.
</li>
<li><code>[&nbsp;]</code> Just as usual, the project matters.
</li>
</ul>



</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 20140903</h3>
<div class="outline-text-3" id="text-1-2">



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Nash bargaining solution</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li>Repetition

</li>
<li>Communication

</li>
<li>Knowledge
<ul>
<li>Existence of other players
</li>
<li>Actions of others
</li>
<li>Payoffs of others and outsiders

</li>
</ul>

</li>
<li>Type of games
<ul>
<li>Of conflicting interest
</li>
<li>Fully cooperative
</li>
<li>Competitive games: {Constant-sum, Zero-sum}

</li>
</ul>

</li>
<li>Fictitious play, reinforce learning.

</li>
<li>The important thing is about the concept. (You have got to
      understand the maths.)
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 20140907</h3>
<div class="outline-text-3" id="text-1-3">



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> President's choice                                        :Decision tree:<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li>Force students to share
<ul>
<li>Fight it.
<ul>
<li>President give include. (3,9)
</li>
<li>get kicked out. (-4,-5)
</li>
</ul>

</li>
<li>Leave. (-5,1)
</li>
<li>Give include. (10,1)
</li>
</ul>

</li>
</ul>



<ul>
<li>Not to share
<ul>
<li>Fight in the next battle. (5,11)
</li>
<li>Be happy. (7,10)
</li>
</ul>

</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 20140917</h3>
<div class="outline-text-3" id="text-1-4">



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> CR4, 13:30</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li>Strategy
<ul>
<li>Pure strategy
</li>
<li>Mixed strategy <b>maxmin</b>
</li>
<li>Val = arg max<sub>pi<sub>i</sub></sub> min<sub>pi<sub>-i</sub></sub> r(pi<sub>i</sub>,pi<sub>-i</sub>)
</li>
<li>All of them probability distribution

</li>
</ul>

</li>
<li>yeah the good old linear programming.
<ul>
<li>Dominant strategy. (Actually, because the "revenue" is linear,
        so we can get the MAX at point bala bala.)

</li>
<li>Rationality. Ref: A beautiful mind. Multi-Agent systems,
        programming and Mathematics.
</li>
</ul>

</li>
</ul>


<ul>
<li id="sec-1-4-1-1"><span class="todo TODO">TODO</span> Does the Nash Equilibrium actually tell you what the machine should do?<br/>
      <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-09-17 Wed</span></span><br/>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> <span class="todo TODO">TODO</span> Courses, Tutorials and Programming</h4>
<div class="outline-text-4" id="text-1-4-2">


</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 20140921</h3>
<div class="outline-text-3" id="text-1-5">



</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Battle of the Sexes</h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">(4,3)</td><td class="left">(2,2)</td></tr>
<tr><td class="left">(1,1)</td><td class="left">(3,4)</td></tr>
</tbody>
</table>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> Extensive-form games.
</p>





</div>
</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-21T13:38+0400</p>
<p class="author">Author: Abraham Xiao</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
